<?php
/*************************************************************************************************
 * -----------------------------------------------------------------------------------------------
 * Ocara开源框架    Socket服务插件Socket 中文简体版错误提示
 * Copyright (c) http://www.ocara.cn All rights reserved.
 * -----------------------------------------------------------------------------------------------
 * @author Lin YiHu <linyhtianwa@163.com>
 ************************************************************************************************/

return array(
    'failed_connect' => array(4450, 'Socket连接失败！'),
    'no_connect' => array(4451, '没有Socket连接！'),
    'no_accept_connect' => array(4452, '没有接收方的连接！'),
    'socket_error' => array(4453, 'Socket $errorType 出错：Error msg:[%s] %s！')
);