<?php
/*************************************************************************************************
 * -----------------------------------------------------------------------------------------------
 * Ocara开源框架    FTP服务插件Ftp 中文简体版错误提示
 * Copyright (c) http://www.ocara.cn All rights reserved.
 * -----------------------------------------------------------------------------------------------
 * @author Lin YiHu <linyhtianwa@163.com>
 ************************************************************************************************/

return array(
	'no_address' 			=> array(4200, 'FTP地址有误！'), 
	'failed_ftp_connect' 	=> array(4201, 'FTP连接失败！'), 
	'failed_ftp_login' 		=> array(4202, 'FTP登录失败！'), 
	'no_write_access' 		=> array(4203, 'FTP下载保存出错，没有可写权限！'), 
	'no_modify_mode_access' => array(4204, '无法修改%s的权限！')
);