<?php
/*************************************************************************************************
 * -----------------------------------------------------------------------------------------------
 * Ocara开源框架   开发者中心配置 《请勿修改》
 * Copyright (c) http://www.ocara.cn All rights reserved.
 * -----------------------------------------------------------------------------------------------
 * @author Lin YiHu <linyhtianwa@163.com>
 ************************************************************************************************/

return array(
    'actions' => array(
        '_form'     => '表单生成',
        '_display'  => '输出模板',
        '_submit'   => '提交后处理',
        '_ajax'     => 'Ajax处理'
    ),
    'controller_actions' => array(
        'CommonController' => array(
            '_form',    '_display',
            '_submit',  '_ajax'
        ),
        'RestController' => array()
    )
);